Revit 2027 API
RebarInSystem.GetPresentationMode Method
 Gets the presentaion mode for this rebar set when displayed in the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarPresentationMode GetPresentationMode(
	View dBView
)
Public Function GetPresentationMode (
	dBView As View
) As RebarPresentationMode
public:
RebarPresentationMode GetPresentationMode(
	View^ dBView
)
member GetPresentationMode :
        dBView : View -> RebarPresentationMode
Parameters
dBView View
 The view.
Return Value
RebarPresentationMode
 The presentation mode.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace